# pip install GDI-effects

from GDI_effects import *

GDI.BW_screen() # Создает черно-белый эффект на экране.
GDI.copy_screen() # Непрерывно копирует всю область экрана и отображает ее без какого-либо смещения.
GDI.error_screen() # Отображает значки ошибок в различных положениях на экране.
GDI.warning_screen() # Случайным образом отображает значок предупреждения на экране.
GDI.question_screen() # Случайным образом отображает значок вопроса на экране.
GDI.asterisk_screen() # Случайным образом отображает значок звездочки на экране.
GDI.super_icon_screen() # случайным образом отображает на экране различные системные значки. 
GDI.invert_screen() # Инвертирует цвета на экране.
GDI.pan_screen() # Перемещает экран в произвольных направлениях.
GDI.Rainbow_blink() # Создает случайные эффекты радуги на экране. экран.
GDI.screen_wavy() # Создает волнистый эффект на экране.
GDI.void_screen() # Создает эффект пустоты на экране.
GDI.glitch_screen() # Создает эффект сбоя на экране.
GDI.tunnel_screen() # Создает эффект туннеля путем непрерывного растягивания и копирования содержимого экрана внутрь от краев.
GDI.twisted_screen() # Применить скрученный экран эффект путем выполнения побитовых операций над содержимым экрана.
GDI.rotate_screen() # Создает эффект поворота всего экрана вокруг фиксированного радиуса.
GDI.repeat_block_rotation() # Создает эффект вращения для небольших блоков на экране.
GDI.draw_random_scribble() # Рисует случайные каракули на экране.
GDItype_text("text") # Отображение текста в случайных местах на экране; текст (строка): текст, который будет отображаться на экране.
GDI.flip_screen_upside_down() # Постоянно переворачивать экран компьютера вверх ногами.
Meme.easter_eggs() # Секрет.

